---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs
source: html/e57d4f15-4376-065a-9b24-cb3ce78af092.htm
---
# DialogBoxShowingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.